Panda Package utilisé pour le calcul scientifique et analyse de données

 Lecture CSV

In [ ]:
import pandas as pd
result = pd.read_csv('csv/athlete_events.csv')
print(result)

In [19]:
res=pd.read_csv('csv/athlete_events.csv').head()
print(res)

   ID                      Name Sex   Age  Height  Weight            Team  \
0   1                 A Dijiang   M  24.0   180.0    80.0           China
1   2                  A Lamusi   M  23.0   170.0    60.0           China
2   3       Gunnar Nielsen Aaby   M  24.0     NaN     NaN         Denmark
3   4      Edgar Lindenau Aabye   M  34.0     NaN     NaN  Denmark/Sweden
4   5  Christine Jacoba Aaftink   F  21.0   185.0    82.0     Netherlands

   NOC        Games  Year  Season       City          Sport  \
0  CHN  1992 Summer  1992  Summer  Barcelona     Basketball
1  CHN  2012 Summer  2012  Summer     London           Judo
2  DEN  1920 Summer  1920  Summer  Antwerpen       Football
3  DEN  1900 Summer  1900  Summer      Paris     Tug-Of-War
4  NED  1988 Winter  1988  Winter    Calgary  Speed Skating

                              Event Medal
0       Basketball Men's Basketball   NaN
1      Judo Men's Extra-Lightweight   NaN
2           Football Men's Football   NaN
3       Tug-Of-War Men's Tug-Of-War  Gold
4  Speed Skating Women's 500 metres   NaN

Affiche la table et son contenue

In [20]:
res1=pd.read_table('csv/athlete_events.csv').head()#affiche la table et son contenue
print(res1)

  ID,"Name","Sex","Age","Height","Weight","Team","NOC","Games","Year","Season","City","Sport","Event","Medal"
0  1,"A Dijiang","M",24,180,80,"China","CHN","199...
1  2,"A Lamusi","M",23,170,60,"China","CHN","2012...
2  3,"Gunnar Nielsen Aaby","M",24,NA,NA,"Denmark"...
3  4,"Edgar Lindenau Aabye","M",34,NA,NA,"Denmark...
4  5,"Christine Jacoba Aaftink","F",21,185,82,"Ne...

Supprime le contenue du fichier avec le header

In [21]:
res2=pd.read_csv('csv/athlete_events.csv',skiprows=1,header=None)# supprime le contenue du fichier avec le header
print(res2)

            0                         1  2     3      4     5   \
0            1                 A Dijiang  M  24.0  180.0  80.0
1            2                  A Lamusi  M  23.0  170.0  60.0
2            3       Gunnar Nielsen Aaby  M  24.0    NaN   NaN
3            4      Edgar Lindenau Aabye  M  34.0    NaN   NaN
4            5  Christine Jacoba Aaftink  F  21.0  185.0  82.0
...        ...                       ... ..   ...    ...   ...
271111  135569                Andrzej ya  M  29.0  179.0  89.0
271112  135570                  Piotr ya  M  27.0  176.0  59.0
271113  135570                  Piotr ya  M  27.0  176.0  59.0
271114  135571        Tomasz Ireneusz ya  M  30.0  185.0  96.0
271115  135571        Tomasz Ireneusz ya  M  34.0  185.0  96.0

                    6    7            8     9       10              11  \
0                China  CHN  1992 Summer  1992  Summer       Barcelona
1                China  CHN  2012 Summer  2012  Summer          London
2              Denmark  DEN  1920 Summer  1920  Summer       Antwerpen
3       Denmark/Sweden  DEN  1900 Summer  1900  Summer           Paris
4          Netherlands  NED  1988 Winter  1988  Winter         Calgary
...                ...  ...          ...   ...     ...             ...
271111        Poland-1  POL  1976 Winter  1976  Winter       Innsbruck
271112          Poland  POL  2014 Winter  2014  Winter           Sochi
271113          Poland  POL  2014 Winter  2014  Winter           Sochi
271114          Poland  POL  1998 Winter  1998  Winter          Nagano
271115          Poland  POL  2002 Winter  2002  Winter  Salt Lake City

                   12                                        13    14
0          Basketball               Basketball Men's Basketball   NaN
1                Judo              Judo Men's Extra-Lightweight   NaN
2            Football                   Football Men's Football   NaN
3          Tug-Of-War               Tug-Of-War Men's Tug-Of-War  Gold
4       Speed Skating          Speed Skating Women's 500 metres   NaN
...               ...                                       ...   ...
271111           Luge                Luge Mixed (Men)'s Doubles   NaN
271112    Ski Jumping  Ski Jumping Men's Large Hill, Individual   NaN
271113    Ski Jumping        Ski Jumping Men's Large Hill, Team   NaN
271114      Bobsleigh                      Bobsleigh Men's Four   NaN
271115      Bobsleigh                      Bobsleigh Men's Four   NaN

[271116 rows x 15 columns]

Crée le contenue du fichier avec le header

In [22]:
res3=pd.read_csv('csv/athlete_events.csv',names=['colonne_1','colonne_2'])# Crée le contenue du fichier avec le header
print(res3)

/home/shad/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3146: DtypeWarning: Columns (0,3,4,5,9) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
                                                                                                                                                         colonne_1  \
ID     Name                 Sex Age  Height Weight Team           NOC Games       Year Season City           Sport                                           Event
1      A Dijiang            M   24   180    80     China          CHN 1992 Summer 1992 Summer Barcelona      Basketball                Basketball Men's Basketball
2      A Lamusi             M   23   170    60     China          CHN 2012 Summer 2012 Summer London         Judo                     Judo Men's Extra-Lightweight
3      Gunnar Nielsen Aaby  M   24   NaN    NaN    Denmark        DEN 1920 Summer 1920 Summer Antwerpen      Football                      Football Men's Football
4      Edgar Lindenau Aabye M   34   NaN    NaN    Denmark/Sweden DEN 1900 Summer 1900 Summer Paris          Tug-Of-War                Tug-Of-War Men's Tug-Of-War
...                                                                                                                                                            ...
135569 Andrzej ya           M   29.0 179.0  89.0   Poland-1       POL 1976 Winter 1976 Winter Innsbruck      Luge                       Luge Mixed (Men)'s Doubles
135570 Piotr ya             M   27.0 176.0  59.0   Poland         POL 2014 Winter 2014 Winter Sochi          Ski Jumping  Ski Jumping Men's Large Hill, Individual
                                                                                                             Ski Jumping        Ski Jumping Men's Large Hill, Team
135571 Tomasz Ireneusz ya   M   30.0 185.0  96.0   Poland         POL 1998 Winter 1998 Winter Nagano         Bobsleigh                        Bobsleigh Men's Four
                                34.0 185.0  96.0   Poland         POL 2002 Winter 2002 Winter Salt Lake City Bobsleigh                        Bobsleigh Men's Four

                                                                                                                         colonne_2
ID     Name                 Sex Age  Height Weight Team           NOC Games       Year Season City           Sport           Medal
1      A Dijiang            M   24   180    80     China          CHN 1992 Summer 1992 Summer Barcelona      Basketball        NaN
2      A Lamusi             M   23   170    60     China          CHN 2012 Summer 2012 Summer London         Judo              NaN
3      Gunnar Nielsen Aaby  M   24   NaN    NaN    Denmark        DEN 1920 Summer 1920 Summer Antwerpen      Football          NaN
4      Edgar Lindenau Aabye M   34   NaN    NaN    Denmark/Sweden DEN 1900 Summer 1900 Summer Paris          Tug-Of-War       Gold
...                                                                                                                            ...
135569 Andrzej ya           M   29.0 179.0  89.0   Poland-1       POL 1976 Winter 1976 Winter Innsbruck      Luge              NaN
135570 Piotr ya             M   27.0 176.0  59.0   Poland         POL 2014 Winter 2014 Winter Sochi          Ski Jumping       NaN
                                                                                                             Ski Jumping       NaN
135571 Tomasz Ireneusz ya   M   30.0 185.0  96.0   Poland         POL 1998 Winter 1998 Winter Nagano         Bobsleigh         NaN
                                34.0 185.0  96.0   Poland         POL 2002 Winter 2002 Winter Salt Lake City Bobsleigh         NaN

[271117 rows x 2 columns]

Rajoute la colonne index qui incremente

In [23]:
res4=pd.read_csv("csv/athlete_events.csv",index_col=[0])#rajoute la colonne index qui incremente
res4.head()

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
ID,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

Selection les colonnes a utilisés grace  leur position

In [24]:
import pandas as pd
donnee_colonnes_position=pd.read_csv("csv/athlete_events.csv",usecols=[1,4,5])# selection les colonnes a utilisés grace  leur position
donnee_colonnes_position.head()

                       Name  Height  Weight
0                 A Dijiang   180.0    80.0
1                  A Lamusi   170.0    60.0
2       Gunnar Nielsen Aaby     NaN     NaN
3      Edgar Lindenau Aabye     NaN     NaN
4  Christine Jacoba Aaftink   185.0    82.0

Selection les colonnes par leur nom

In [25]:
donnee_uscols=pd.read_csv("csv/athlete_events.csv",usecols=["Name","Height","Weight"])#selection les colonnes par leur nom
donnee_colonnes_position.head()

                       Name  Height  Weight
0                 A Dijiang   180.0    80.0
1                  A Lamusi   170.0    60.0
2       Gunnar Nielsen Aaby     NaN     NaN
3      Edgar Lindenau Aabye     NaN     NaN
4  Christine Jacoba Aaftink   185.0    82.0

In [26]:
import pandas as pd
donnee_dates=pd.read_csv("csv/athlete_events.csv",parse_dates=[9])
donnee_dates.dtypes # types de données et nom des colonnes et n considere que la colonne 9 
#donnee_dates est un dataframe

ID                 int64
Name              object
Sex               object
Age              float64
Height           float64
Weight           float64
Team              object
NOC               object
Games             object
Year      datetime64[ns]
Season            object
City              object
Sport             object
Event             object
Medal             object
dtype: object

lecture XLSX

In [27]:
import pandas as pd
donnee_excel=pd.read_excel('xlsx/athlete_events.xlsx', sheet_name='Feuille2')
donnee_excel.head()

XLRDError: No sheet named <'Feuille2'>

Lecture Database

In [29]:
import pandas as pd
import sqlite3

connexion = sqlite3.connect('db/chinook.db') #se conecter a une base de données
requete ="SELECT * FROM employees;" #lecture de la table
resultats= pd.read_sql(requete,con=connexion) #on stock le resultat de la lecture 
resultats

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01 00:00:00,2003-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,1970-05-29 00:00:00,2004-01-02 00:00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,1968-01-09 00:00:00,2004-03-04 00:00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

Lecture Json

In [30]:
import pandas as pd 
pd.read_json('json/example.json')

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Exporter un dataFrame dans un CSV

In [31]:
donnee_dates.to_csv("csv/res.csv",sep=',')#crée un csv
print(donnee_dates)

            ID                      Name Sex   Age  Height  Weight  \
0            1                 A Dijiang   M  24.0   180.0    80.0
1            2                  A Lamusi   M  23.0   170.0    60.0
2            3       Gunnar Nielsen Aaby   M  24.0     NaN     NaN
3            4      Edgar Lindenau Aabye   M  34.0     NaN     NaN
4            5  Christine Jacoba Aaftink   F  21.0   185.0    82.0
...        ...                       ...  ..   ...     ...     ...
271111  135569                Andrzej ya   M  29.0   179.0    89.0
271112  135570                  Piotr ya   M  27.0   176.0    59.0
271113  135570                  Piotr ya   M  27.0   176.0    59.0
271114  135571        Tomasz Ireneusz ya   M  30.0   185.0    96.0
271115  135571        Tomasz Ireneusz ya   M  34.0   185.0    96.0

                  Team  NOC        Games       Year  Season            City  \
0                China  CHN  1992 Summer 1992-01-01  Summer       Barcelona
1                China  CHN  2012 Summer 2012-01-01  Summer          London
2              Denmark  DEN  1920 Summer 1920-01-01  Summer       Antwerpen
3       Denmark/Sweden  DEN  1900 Summer 1900-01-01  Summer           Paris
4          Netherlands  NED  1988 Winter 1988-01-01  Winter         Calgary
...                ...  ...          ...        ...     ...             ...
271111        Poland-1  POL  1976 Winter 1976-01-01  Winter       Innsbruck
271112          Poland  POL  2014 Winter 2014-01-01  Winter           Sochi
271113          Poland  POL  2014 Winter 2014-01-01  Winter           Sochi
271114          Poland  POL  1998 Winter 1998-01-01  Winter          Nagano
271115          Poland  POL  2002 Winter 2002-01-01  Winter  Salt Lake City

                Sport                                     Event Medal
0          Basketball               Basketball Men's Basketball   NaN
1                Judo              Judo Men's Extra-Lightweight   NaN
2            Football                   Football Men's Football   NaN
3          Tug-Of-War               Tug-Of-War Men's Tug-Of-War  Gold
4       Speed Skating          Speed Skating Women's 500 metres   NaN
...               ...                                       ...   ...
271111           Luge                Luge Mixed (Men)'s Doubles   NaN
271112    Ski Jumping  Ski Jumping Men's Large Hill, Individual   NaN
271113    Ski Jumping        Ski Jumping Men's Large Hill, Team   NaN
271114      Bobsleigh                      Bobsleigh Men's Four   NaN
271115      Bobsleigh                      Bobsleigh Men's Four   NaN

[271116 rows x 15 columns]

Creation d'une Series, c'est des colonne de tableau

In [2]:
import numpy as np
import pandas as pd 

mes_nombres= pd.Series(np.random.choice(list(range(0,500)),10))
print(mes_nombres)

0     77
1    164
2     64
3    492
4     50
5    484
6    230
7    220
8    481
9    152
dtype: int64

Imprimé une serie

In [4]:
ma_serie=pd.Series([25,45,62,12,11])#imprimé une serie
print(ma_serie)

0    25
1    45
2    62
3    12
4    11
dtype: int64

Série avec num et lettres

In [5]:
ma_list=["BadKev",1,3,5,7,8]#Série avec num et lettres
print(ma_list)

['BadKev', 1, 3, 5, 7, 8]

liste dans Série

In [6]:
print(pd.Series(ma_list))#liste dans Série

0    BadKev
1         1
2         3
3         5
4         7
5         8
dtype: object

Donne les type des donnés des case 0 et 1

In [7]:
series_mixed=pd.Series(ma_list)#donne les type des donnés des case 0 et 1
print(type(series_mixed[0]))
print(type(series_mixed[1]))

<class 'str'>
<class 'int'>

List dans un tableau

In [8]:
ma_serie_de_poids_index=pd.read_csv("csv/athlete_events.csv",usecols=[5],squeeze=True)
print(ma_serie_de_poids_index)

0         80.0
1         60.0
2          NaN
3          NaN
4         82.0
          ...
271111    89.0
271112    59.0
271113    59.0
271114    96.0
271115    96.0
Name: Weight, Length: 271116, dtype: float64

Choisir l'index dans un tableau et les colonnes

In [9]:
ma_serie_de_poids=pd.read_csv("csv/athlete_events.csv",usecols=[1,5],squeeze=True,index_col=[0])#selectionne des colonnes afficher 
ma_serie_de_poids

Name
A Dijiang                   80.0
A Lamusi                    60.0
Gunnar Nielsen Aaby          NaN
Edgar Lindenau Aabye         NaN
Christine Jacoba Aaftink    82.0
                            ...
Andrzej ya                  89.0
Piotr ya                    59.0
Piotr ya                    59.0
Tomasz Ireneusz ya          96.0
Tomasz Ireneusz ya          96.0
Name: Weight, Length: 271116, dtype: float64

Indexer via la position des valeur

In [10]:
ma_serie_de_poids_index[[0,15,6985,425]]#indeer via la pisition pour accédé

0       80.0
15      75.0
6985    59.0
425     58.0
Name: Weight, dtype: float64

Indexing via etiquette des valeurs

In [11]:
ma_serie_de_poids[["Antti Sami Aalto","Andrzej ya"]]# prend en compt uniquement les valeurs présent dans les les colonne definies

Name
Antti Sami Aalto    96.0
Andrzej ya          89.0
Name: Weight, dtype: float64

In [12]:
print(ma_serie_de_poids)

Name
A Dijiang                   80.0
A Lamusi                    60.0
Gunnar Nielsen Aaby          NaN
Edgar Lindenau Aabye         NaN
Christine Jacoba Aaftink    82.0
                            ...
Andrzej ya                  89.0
Piotr ya                    59.0
Piotr ya                    59.0
Tomasz Ireneusz ya          96.0
Tomasz Ireneusz ya          96.0
Name: Weight, Length: 271116, dtype: float64

indexeur loc et iloc (etiquette et posiion)

In [13]:
ma_serie=pd.Series([10,11,12,13], index=[1,3,2,0])
ma_serie[0]

13

In [14]:
ma_serie.loc[0]

13

In [15]:
ma_serie.iloc[0]

10

Indexing via une expression booléenne

In [16]:
ma_serie_de_poids>90

Name
A Dijiang                   False
A Lamusi                    False
Gunnar Nielsen Aaby         False
Edgar Lindenau Aabye        False
Christine Jacoba Aaftink    False
                            ...
Andrzej ya                  False
Piotr ya                    False
Piotr ya                    False
Tomasz Ireneusz ya           True
Tomasz Ireneusz ya           True
Name: Weight, Length: 271116, dtype: bool

In [17]:
ma_serie_de_poids[ma_serie_de_poids>90]#affiche

Name
Antti Sami Aalto           96.0
Timo Antero Aaltonen      130.0
Andreea Aanei             125.0
Dagfinn Sverre Aarskog     98.0
Hans Aasns                 93.0
                          ...
Henk Jan Zwolle            93.0
Dominik ycki               95.0
Dominik ycki               95.0
Tomasz Ireneusz ya         96.0
Tomasz Ireneusz ya         96.0
Name: Weight, Length: 16819, dtype: float64